Revit 2027 API
BuiltInFailures.CurtainWallFailures.MustReplacePanels Property
 Missing Curtain Panels will be replaced with System Panels to complete command.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MustReplacePanels { get; }
Public Shared ReadOnly Property MustReplacePanels As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MustReplacePanels {
	FailureDefinitionId^ get ();
}
static member MustReplacePanels : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CurtainWallFailures Class
Autodesk.Revit.DB Namespace